api/ws-submitMail.html

<div class ="sidebar" >    
    <h2>Kazalo:</h2>
    <ul>
        <li><a href="#api/ws-submitMail.hmlt">Submit-mail</a></li> 
        <li><a href="#documentation:webservices">Spletne storitve</a></li> 
    </ul>
</div>
<div class="main">
<article class='content'>
    
    <!-- a href="#project">Zgradna projekta</a><br  / -->

<h1>Metoda: submitMail</h1>
Poizvedbe: <a href="api/wsdl/messages/SubmitMailRequest.xsd">SubmitMailRequest.xsd</a><br />
Odgovora: <a href="api/wsdl/messages/SubmitMailResponse.xsd">SubmitMailResponse.xsd</a><br />
Shema izhodne pošiljke: <a href="api/wsdl/entities/outbox-mail.xsd">outbox-mail.xsd</a><br />
Namen metode je oddaja izhodne pošiljke v vročanje. Vhodni parameter je infoset podatkov  „OutMail“, ki 
vsebuje pošiljatelja, naslovnika, opis vsebine, priponke in dodatne parametre pošiljke. 
<br />
<h2>Podatki izhodne pošiljke</h2>
<div class="jrcxslt" data-xml="api/wsdl/entities/outbox-mail.xsd" data-xslt="xslt/mshinmail2table.xslt"></div>
<h2>Primer poizvedbe</h2>

 <pre><code>&lt;soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:laur="http://laurentius.si" xmlns:mail="http://outbox.laurentius.si/mail"
xmlns:prop="http://outbox.laurentius.si/property" 
xmlns:pay="http://outbox.laurentius.si/payload">
   &lt;soapenv:Header/>
   &lt;soapenv:Body>
      &lt;laur:SubmitMailRequest>
         &lt;Control userId="TestUser" applicationId="CMS" />
         &lt;Data>
            &lt;mail:OutMail 
            	senderMessageId="cms-id-00001" 
            	conversationId="cms-conv-00001" 
            	service="DeliveryWithReceipt" 
            	action="Delivery"             
            	subject="Fist test mail" 
             	receiverEBox="ezk@court-laurentius.si" receiverName="Zemljiška knjiga" 
             	senderEBox="izvrsba@court-laurentius.si" senderName="Izvršilni oddelek">
               &lt;prop:OutProperties>
                  &lt;!--Zero or more repetitions:-->
                  &lt;prop:OutProperty name="Opr. St.">VL 1/20016&lt;/prop:OutProperty>
                  &lt;prop:OutProperty name="SodiSif">S20&lt;/prop:OutProperty>
               &lt;/prop:OutProperties>
               &lt;!--Optional:-->
               &lt;pay:OutPayload>
                  &lt;!--Zero or more repetitions:-->
                   &lt;pay:OutPart name="test" 
                  description="testnaDatoteka"
                  type="1" filename="testnaDatoteka.xml" 
                  mimeType="plain/xml" 
                  encoding="UTF-8" filepath="123">
                     &lt;!--Optional:-->
                     &lt;pay:Bin>VGVzdG5vIHNwb3JvY2lsbw==&lt;/pay:Bin>
                  &lt;/pay:OutPart>
               &lt;/pay:OutPayload>
            &lt;/mail:OutMail>
         &lt;/Data>
      &lt;/laur:SubmitMailRequest>
   &lt;/soapenv:Body>
&lt;/soapenv:Envelope>
</code></pre>

<h2>Primer odgovora</h2>
 <pre><code>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   &lt;soap:Body>
      &lt;ns2:SubmitMailResponse xmlns:ns2="http://laurentius.si" xmlns:ns3="http://outbox.laurentius.si/event" xmlns:ns4="http://inbox.laurentius.si/property" xmlns:ns5="http://inbox.laurentius.si/payload" xmlns:ns6="http://inbox.laurentius.si/mail" xmlns:ns7="http://outbox.laurentius.si/property" xmlns:ns8="http://outbox.laurentius.si/payload" xmlns:ns9="http://outbox.laurentius.si/mail" xmlns:ns10="http://inbox.laurentius.si/event">
         &lt;RControl returnValue="1" returnText=""/>
         &lt;RData mailId="47" senderMessageId="cms-id-00001" submittedDate="2016-11-27T11:08:09.109+01:00"/>
      &lt;/ns2:SubmitMailResponse>
   &lt;/soap:Body>
&lt;/soap:Envelope>
</code></pre>

<h2>Primer napake</h2>
 <pre><code>&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   &lt;soap:Body>
      &lt;soap:Fault>
         &lt;faultcode>soap:Server&lt;/faultcode>
         &lt;faultstring>INVALID_DATA:Sender box [SubmitMailRequest/Data/OutMail/@senderEBox]:  ne-obstaja@court-laurentius.si not exists&lt;/faultstring>
         &lt;detail>
            &lt;ns2:SEDException xmlns:ns9="http://outbox.laurentius.si/mail" xmlns:ns8="http://outbox.laurentius.si/payload" xmlns:ns7="http://outbox.laurentius.si/property" xmlns:ns6="http://inbox.laurentius.si/mail" xmlns:ns5="http://inbox.laurentius.si/payload" xmlns:ns4="http://inbox.laurentius.si/property" xmlns:ns3="http://outbox.laurentius.si/event" xmlns:ns2="http://laurentius.si" xmlns:ns10="http://inbox.laurentius.si/event">
               &lt;ns2:errorCode>InvalidData&lt;/ns2:errorCode>
               &lt;ns2:message>Sender box [SubmitMailRequest/Data/OutMail/@senderEBox]:  ne-obstaja@court-laurentius.si not exists&lt;/ns2:message>
            &lt;/ns2:SEDException>
         &lt;/detail>
      &lt;/soap:Fault>
   &lt;/soap:Body>
&lt;/soap:Envelope>
</code></pre>




</article>  
</div>